{
  "resume": {
    "0": {
      "employer": "AT&T Cybersecurity",
      "dates": "2022-07 - 2023-05, 2023-11 - current",
      "title": "Senior Full Stack Engineer",
      "highlights": {
        "0": "Created automated Python scripts to interface with cybersecurity platforms to process and output complex datasets. Datasets are in turn ingested into Power BI dashboards, enabling analysts and threat hunters to track customer data and detect security risks more effectively.",
        "1": "Maintaining and developing new back-end (Python) features for AT&T Cybersecurity's Open Threat Exchange (OTX) and its subsystems, improving reliability and shoring up existing flaws and vulnerabilities.",
        "2": "Utilizing AWS services such as S3, Elastic Container Registry, Elastic Container Service, EC2, SNS, SQS, Aurora, CloudWatch, OpenSearch, Lambda, and more to configure services and to provide support for developing and deploying applications.",
        "3": "Performing UI feature updates (Angular) and back-end maintenance for AT&T Cybersecurity's Open Threat Exchange (OTX), correcting existing defects and enhancing the user experience.",
        "4": "Building new UI feature sets (Angular) for the USM Anywhere software as a service (SaaS) security monitoring solution, enabling users to perform advanced queries for retrieving back-end data from AWS OpenSearch."
      }
    },
    "1": {
      "employer": "Integris Group, LLC",
      "dates": "2021-11 - 2022-05",
      "title": "Senior Full Stack Engineer",
      "highlights": {
        "0": "Developed full stack proof of concept for risk management application utilizing Microsoft Azure, Azure Data Studio, T-SQL, Python Flask API, Angular, and SCSS based on requirements gathering and consultation with the client and product management.",
        "1": "Aided with mobile development of a health and performance application using the Ionic Framework built on Angular and performed testing with emulators and mobile devices."
      }
    },
    "2": {
      "employer": "Rural Sourcing, Inc.",
      "dates": "2021-06 - 2021-10",
      "title": "Senior Front End Engineer",
      "highlights": {
        "0": "Collaborated with client UI/UX lead to modernize enterprise cloud migration software UI using React, Redux, JavaScript, jQuery, SASS, and PHP hosted on AWS EC2 instance."
      }
    },
    "3": {
      "employer": "Overlayer (Nights and Weekends)",
      "dates": "2019-10 - 2021-06",
      "title": "Full Stack Engineer",
      "highlights": {
        "0": "Extended image technology from A Birthday Place to target vendors, enabling the ability to customize T-shirts, coffee mugs, jewelry, etc. in the custom-made product space.",
        "1": "Designed feature-rich, responsive UI with Angular Material to allow users to manipulate images by providing image templates, color grids, text placement, font options, and texture shading.",
        "2": "Wrote RESTful Python API to support processes such as image storage, retrieval, and manipulation in an efficient and fault-tolerant manner."
      }
    },
    "4": {
      "employer": "A Birthday Place",
      "dates": "2017-11 - 2021-06",
      "title": "Full Stack Engineer",
      "highlights": {
        "0": "Developed web application (Angular/Python) to manipulate professional product images to draw customer attention to storefronts, improving retail presence and supporting $1M revenue.",
        "1": "Designed and created automated systems in Python to support the management of over 12,000 individual products, expanding company catalog by more than ten times the previous amount.",
        "2": "Led Shopify home storefront development, which increased yearly gross revenue by 150%.",
        "3": "Leveraged PostgreSQL and Redis task queue to manage performant back-end processes."
      }
    },
    "5": {
      "employer": "Blueridge IT Solutions, Inc.",
      "dates": "2016-07 - 2017-01",
      "title": "Web Developer",
      "highlights": {
        "0": "Implemented Learning Management System (LMS) for U.S. Department of Veterans Affairs with JavaScript frameworks and Bootstrap CSS, assisting veterans with healthy sleep practices."
      }
    },
    "6": {
      "employer": "ResQue, LLC",
      "dates": "2015-12 - 2016-04",
      "title": "Web Developer",
      "highlights": {
        "0": "Used JavaScript, Node.js, Meteor.js, jQuery, MongoDB, and Bootstrap CSS to create responsive application that enabled real estate agents to dramatically improve social media engagement."
      }
    }
  },
  "skills": {
    "Angular":"6",
    "TypeScript":"6",
    "JavaScript":"7",
    "Jasmine/Karma":"3",
    "Node.js":"1",
    "React":"0.5",
    "jQuery":"5",
    "HTML":"7",
    "SASS/CSS":"7",
    "Building User Interfaces":"7",
    "Python":"6",
    "Flask":"6",
    "REST APIs":"6",
    "SQL":"5",
    "PostgreSQL":"3",
    "sqlite3":"4",
    "MongoDB":"0.5",
    "DigitalOcean (Cloud)":"5",
    "AWS":"2",
    "Azure":"1",
    "CI/CD":"5",
    "Docker":"3",
    "RancherOS":"1",
    "Linux":"9",
    "Agile":"6",
    "JIRA":"2",
    "Confluence":"2"
  }
}
